{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.19.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": "float32", "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 100], "dtype": "float32", "sparse": false, "name": "embedding_input"}}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "dtype": "float32", "input_dim": 119547, "output_dim": 200, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "merge_mode": "concat", "layer": {"module": null, "class_name": "CustomGRU", "config": {"name": "forward_custom_gru", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "reset_after": true, "seed": null}, "registered_name": "Custom>CustomGRU", "build_config": {"input_shape": [null, 100, 200]}}, "backward_layer": {"module": null, "class_name": "CustomGRU", "config": {"name": "backward_custom_gru", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "reset_after": true, "seed": null}, "registered_name": "Custom>CustomGRU", "build_config": {"input_shape": [null, 100, 200]}}}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 100]}}, "training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of24.bin", "group1-shard2of24.bin", "group1-shard3of24.bin", "group1-shard4of24.bin", "group1-shard5of24.bin", "group1-shard6of24.bin", "group1-shard7of24.bin", "group1-shard8of24.bin", "group1-shard9of24.bin", "group1-shard10of24.bin", "group1-shard11of24.bin", "group1-shard12of24.bin", "group1-shard13of24.bin", "group1-shard14of24.bin", "group1-shard15of24.bin", "group1-shard16of24.bin", "group1-shard17of24.bin", "group1-shard18of24.bin", "group1-shard19of24.bin", "group1-shard20of24.bin", "group1-shard21of24.bin", "group1-shard22of24.bin", "group1-shard23of24.bin", "group1-shard24of24.bin"], "weights": [{"name": "sequential/bidirectional/forward_custom_gru/gru_cell/kernel", "shape": [200, 384], "dtype": "float32"}, {"name": "sequential/bidirectional/forward_custom_gru/gru_cell/recurrent_kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "sequential/bidirectional/forward_custom_gru/gru_cell/bias", "shape": [2, 384], "dtype": "float32"}, {"name": "sequential/bidirectional/backward_custom_gru/gru_cell/kernel", "shape": [200, 384], "dtype": "float32"}, {"name": "sequential/bidirectional/backward_custom_gru/gru_cell/recurrent_kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "sequential/bidirectional/backward_custom_gru/gru_cell/bias", "shape": [2, 384], "dtype": "float32"}, {"name": "sequential/dense/kernel", "shape": [256, 1], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [1], "dtype": "float32"}, {"name": "sequential/embedding/embeddings", "shape": [119547, 200], "dtype": "float32"}]}]}